clear;
clc;

%Начальные параметры 
%Кг, м/с
% Заданы: Солнце, Земля, Луна (Земля в афелии, для Луны взяты средние данные), комета Галлея
mass = [1.9891*10^30; 5.9736*10^24; 7.3477*10^22; 2.2*10^14];
coordinates = [0 0; 1.52098232*10^11 0; 1.52098232*10^11+3.84467*10^8 0; 5.24824*10^12 0];
velocities = [0 -0.089021687078894; 0 29270; 0 29270+1023; 0 -900];

% Гравитационная постоянная
g = 6.67300*10^(-11);

% Отрезок времени на всякий случай. Одни сутки в секундах.
delta_t(1)=86400;
N=365*50;
fin=(N*delta_t(1));
u=zeros(N,16);

% Физика.
%Х-координаты Солнца и Земли, Луны и кометы Галлея
x_e=[];x_s=[]; x_m=[]; x_g=[];
%Y-координаты Солнца и Земли, Луны и кометы Галлея
y_e=[];y_s=[]; y_m=[]; y_g=[];
%Х-скорости Солнца и Земли, Луны и кометы Галлея
vx_e=[];vx_s=[]; vx_m=[]; vx_g=[];
%Y-скорости Солнца и Земли, Луны и кометы Галлея
vy_e=[];vy_s=[]; vy_m=[]; vy_g=[];
%Время
t=[];

%Начальные условия
%Солнце
vx_s(1)= velocities(1,1);
vy_s(1)= velocities(1,2);
x_s(1)= coordinates(1,1);
y_s(1)= coordinates(1,2);

%Земля
vx_e(1)= velocities(2,1);
vy_e(1)= velocities(2,2);
x_e(1)= coordinates(2,1);
y_e(1)= coordinates(2,2);

%Луна
vx_m(1)= velocities(3,1);
vy_m(1)= velocities(3,2);
x_m(1)= coordinates(3,1);
y_m(1)= coordinates(3,2);

%Комета Галлея
vx_g(1)= velocities(4,1);
vy_g(1)= velocities(4,2);
x_g(1)= coordinates(4,1);
y_g(1)= coordinates(4,2);

u=[x_s(1) y_s(1) vx_s(1) vy_s(1)...
   x_e(1) y_e(1) vx_e(1) vy_e(1)...
   x_m(1) y_m(1) vx_m(1) vy_m(1)...
   x_g(1) y_g(1) vx_g(1) vy_g(1)];

% %   Одностадийная схема ERK1
% b=[];
% c=[];
% a(1)=0;
% b(1)=1;
% c(1)=0.5;
% s=1;

% %   Двухстадийная схема ERK2
% a=[];
% b=[];
% w=[];
% s=2;
%     
% b(1)=0.25;
% b(2)=0.75;
% a(1)=0;
% a(2)=2/3;
% 
%   Трёхстадийная схема ERK3
a=[];
b=[];
w=[];
s=3;
    
b(1)=2/9;
b(2)=1/3;
b(3)=4/9;
  
a(1)=0;
a(2)=1/2;
a(3)=3/4;

for i=1:N-1
    for k=1:s
        sum=zeros(1,16);
        for l=1:k-1
            sum(:)=sum(:)+a(l)*w(l);
        end;
        w(k,:)=funct(mass,u(i,:)+delta_t*sum);
    end;
    sum=zeros(1,16);
    for k=1:s    
        sum=sum+b(k)*w(k,:);
    end;
	u(i+1,:)=u(i,:)+delta_t*sum;
end;

plot(u(:,1),u(:,2),'o');
hold on;
plot(u(:,5),u(:,6),'--');
hold on;
plot(u(:,9),u(:,10),'-.');
% hold on;
% plot(u(:,13),u(:,14),'-');
    
