% Подготовьте программу, которая по заданному набору точек
% интерполирует (экстраполирует) кривую. 
clear
clc

t=[];
x=[];
y=[];

x0=2;
y0=2;

left=0;
right=3;
N=10;

syms T1 Y W1 W2 X;

%Формирование кривой. 
h=(pi)/(N-1);

for i=1:N
	x(i)=x0+2*cos(-pi/2+(i-1)*h);
	y(i)=y0+2*sin(-pi/2+(i-1)*h);    
end;

%Параметризация. Делаем вид, что не знаем закон по которому мы получили
%данные
for i=1:N
    t(i)= i;
end;

%Интерполяция обеих переменных по параметру
% ht=(t(N)-t(1))/(N-1);
% Многолчен для X_______________________________________________________
ux=zeros(N,N+1);

for i=1:N
% 	x(i)=left+(i-1)*h;
    ux(i,1)=x(t(i));
%     ye(i)=extra(x(i));
end;

%Номер столбца
for j=2:N
	%Номер строки
	for i=j:N
        ux(i,j)=(j-1)*(ux(i-1,j-1)-ux(i,j-1))/(t(j-1)-t(j));
	end;
end;    
X = ux(1,1);
W1 = 1;
for i=1:N-1
	W1 = W1*(T1-t(i));
	X=X+(ux(i+1,i+1))*W1/factorial(i);
end;

% Многолчен для Y_______________________________________________________
uy=zeros(N,N+1);
for i=1:N
% 	x(i)=left+(i-1)*h;
    uy(i,1)=y(t(i));
%     ye(i)=extra(x(i));
end;

%Номер столбца
for j=2:N
	%Номер строки
	for i=j:N
        uy(i,j)=(j-1)*(uy(i-1,j-1)-uy(i,j-1))/(t(j-1)-t(j));
	end;
end;    
Y = uy(1,1);
W2 = 1;
for i=1:N-1
	W2 = W2*(T1-t(i));
	Y=Y+(uy(i+1,i+1))*W2/factorial(i);
end;

  plot(x,y);
  hold on;
 ezplot(X,Y,[1,N]);
% ezplot(Y,0,5);